"use strict";

const express = require(`express`);
const request = require(`supertest`);
const Sequelize = require(`sequelize`);

const initDB = require(`../lib/init-db`);
const user = require(`./user-routes`);
const UserService = require(`../data-service/user`);

const {HttpCode} = require(`../../constants`);

const mockUsers = [
  {
    name: `Alex`,
    surname: ``,
    avatar: `dvsdv.jpg`,
    email: `alex@gmail.com`,
    passwordHash: `123456`
  },
  {
    name: `Иван`,
    surname: `Иванович`,
    avatar: ``,
    email: `ivan@gmail.com`,
    passwordHash: `superpassword`,
  },
  {
    name: `Дарья`,
    surname: `King`,
    avatar: `mav.jpg`,
    email: `darya_king@mail.ru`,
    passwordHash: `ololo*123`,
  },
  {
    name: `Иван`,
    surname: `Иванов`,
    avatar: ``,
    email: `ivanov@example.com`,
    passwordHash: `$2a$10$md39A8Jx/PXKP2rjhYKmlu.gM.yu0fAadh0riPYIKX2NZwlZZJzQW`,
  },
  {
    name: `Петр`,
    surname: `Пертов`,
    avatar: ``,
    email: `petrov@example.com`,
    passwordHash: `$2a$10$RbKuboiusRh4fN4THPLkY.RMGLJ.KSMzlrRGQijzwhOYp2GHeVpJ6`,
  },
];

const mockCategories = [
  `За жизнь`,
  `Разное`,
  `IT`,
  `Кино`,
  `Музыка`,
  `Железо`,
  `Деревья`,
  `Без рамки`,
  `Программирование`
];

const mockArticles = [
  {
    "user": `ivanov@example.com`,
    "title": `Ёлки. История деревьев. Загадки человечества`,
    "announce": `Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Это один из лучших рок-музыкантов. Как начать действовать? Для начала просто соберитесь. Из под его пера вышло 8 платиновых альбомов.`,
    "fullText": `Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать. Собрать камни бесконечности легко если вы прирожденный герой. Этот смартфон — настоящая находка. Большой и яркий экран мощнейший процессор — всё это в небольшом гаджете. Как начать действовать? Для начала просто соберитесь. Достичь успеха помогут ежедневные повторения. Помните небольшое количество ежедневных упражнений лучше чем один раз но много. Из под его пера вышло 8 платиновых альбомов. Ёлки — это не просто красивое дерево. Это прочная древесина. Игры и программирование разные вещи. Не стоит идти в программисты если вам нравятся только игры. Золотое сечение — соотношение двух величин гармоническая пропорция. Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Программировать не настолько сложно как об этом говорят. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Он написал больше 30 хитов. Это один из лучших рок-музыкантов. Первая большая ёлка была установлена только в 1938 году. Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле? Простые ежедневные упражнения помогут достичь успеха.`,
    "createdAt": `2021-06-07 15:59:27`,
    "categories": [
      `Кино`,
      `Программирование`,
      `IT`,
      `Без рамки`,
      `Разное`,
      `Музыка`,
      `Деревья`
    ],
    "comments": [
      {
        "user": `ivanov@example.com`,
        "text": `Плюсую, но слишком много буквы! Согласен с автором! Это где ж такие красоты?`
      },
      {
        "user": `ivanov@example.com`,
        "text": `Мне кажется или я уже читал это где-то? Давно не пользуюсь стационарными компьютерами. Ноутбуки победили. Мне не нравится ваш стиль. Ощущение, что вы меня поучаете.`
      },
      {
        "user": `ivanov@example.com`,
        "text": `Мне не нравится ваш стиль. Ощущение, что вы меня поучаете. Совсем немного... Планируете записать видосик на эту тему?`
      }
    ]
  },
  {
    "user": `ivanov@example.com`,
    "title": `Борьба с прокрастинацией. Как перебороть себя?`,
    "announce": `Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле?`,
    "fullText": `Игры и программирование разные вещи. Не стоит идти в программисты если вам нравятся только игры. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Как начать действовать? Для начала просто соберитесь. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Первая большая ёлка была установлена только в 1938 году. Помните небольшое количество ежедневных упражнений лучше чем один раз но много. Достичь успеха помогут ежедневные повторения. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать. Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле? Золотое сечение — соотношение двух величин гармоническая пропорция. Простые ежедневные упражнения помогут достичь успеха. Этот смартфон — настоящая находка. Большой и яркий экран мощнейший процессор — всё это в небольшом гаджете. Программировать не настолько сложно как об этом говорят. Это один из лучших рок-музыкантов. Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Собрать камни бесконечности легко если вы прирожденный герой. Ёлки — это не просто красивое дерево. Это прочная древесина.`,
    "createdAt": `2021-05-08 03:57:55`,
    "categories": [
      `Без рамки`,
      `Кино`,
      `Деревья`,
      `Музыка`,
      `За жизнь`
    ],
    "comments": [
      {
        "user": `ivanov@example.com`,
        "text": `Согласен с автором!`
      },
      {
        "user": `ivanov@example.com`,
        "text": `Совсем немного...`
      }
    ]
  },
  {
    "user": `ivanov@example.com`,
    "title": `Лучшие рок-музыканты 20-века подарившие нам хиты на века`,
    "announce": `Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Он написал больше 30 хитов. Из под его пера вышло 8 платиновых альбомов. Первая большая ёлка была установлена только в 1938 году.`,
    "fullText": `Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Программировать не настолько сложно как об этом говорят. Собрать камни бесконечности легко если вы прирожденный герой. Как начать действовать? Для начала просто соберитесь. Простые ежедневные упражнения помогут достичь успеха. Из под его пера вышло 8 платиновых альбомов. Он написал больше 30 хитов. Это один из лучших рок-музыкантов. Игры и программирование разные вещи. Не стоит идти в программисты если вам нравятся только игры. Достичь успеха помогут ежедневные повторения. Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле? Ёлки — это не просто красивое дерево. Это прочная древесина. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Помните небольшое количество ежедневных упражнений лучше чем один раз но много. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Этот смартфон — настоящая находка. Большой и яркий экран мощнейший процессор — всё это в небольшом гаджете. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Золотое сечение — соотношение двух величин гармоническая пропорция.`,
    "createdAt": `2021-03-21 06:19:18`,
    "categories": [
      `Железо`,
      `Программирование`,
      `Деревья`,
      `IT`,
      `За жизнь`
    ],
    "comments": [
      {
        "user": `ivanov@example.com`,
        "text": `Планируете записать видосик на эту тему? Мне кажется или я уже читал это где-то?`
      }
    ]
  },
  {
    "user": `ivanov@example.com`,
    "title": `Лучшие рок-музыканты 20-века подарившие нам хиты на века`,
    "announce": `Это один из лучших рок-музыкантов. Помните небольшое количество ежедневных упражнений лучше чем один раз но много. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать.`,
    "fullText": `Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Игры и программирование разные вещи. Не стоит идти в программисты если вам нравятся только игры. Простые ежедневные упражнения помогут достичь успеха. Помните небольшое количество ежедневных упражнений лучше чем один раз но много. Достичь успеха помогут ежедневные повторения. Это один из лучших рок-музыкантов. Этот смартфон — настоящая находка. Большой и яркий экран мощнейший процессор — всё это в небольшом гаджете. Золотое сечение — соотношение двух величин гармоническая пропорция. Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле? Ёлки — это не просто красивое дерево. Это прочная древесина. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать. Из под его пера вышло 8 платиновых альбомов. Как начать действовать? Для начала просто соберитесь. Программировать не настолько сложно как об этом говорят. Собрать камни бесконечности легко если вы прирожденный герой. Он написал больше 30 хитов. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами.`,
    "createdAt": `2021-04-24 13:02:10`,
    "categories": [
      `Разное`,
      `Программирование`,
      `Деревья`,
      `IT`,
      `Без рамки`,
      `За жизнь`
    ],
    "comments": [
      {
        "user": `ivanov@example.com`,
        "text": `Мне не нравится ваш стиль. Ощущение, что вы меня поучаете.`
      },
      {
        "user": `ivanov@example.com`,
        "text": `Это где ж такие красоты? Давно не пользуюсь стационарными компьютерами. Ноутбуки победили.`
      }
    ]
  },
  {
    "user": `ivanov@example.com`,
    "title": `Что такое золотое сечение и где его найти...`,
    "announce": `Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле? Собрать камни бесконечности легко если вы прирожденный герой. Помните небольшое количество ежедневных упражнений лучше чем один раз но много. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами.`,
    "fullText": `Золотое сечение — соотношение двух величин гармоническая пропорция. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Он написал больше 30 хитов. Помните небольшое количество ежедневных упражнений лучше чем один раз но много. Из под его пера вышло 8 платиновых альбомов. Собрать камни бесконечности легко если вы прирожденный герой. Это один из лучших рок-музыкантов. Простые ежедневные упражнения помогут достичь успеха. Первая большая ёлка была установлена только в 1938 году. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле? Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать. Этот смартфон — настоящая находка. Большой и яркий экран мощнейший процессор — всё это в небольшом гаджете. Как начать действовать? Для начала просто соберитесь. Программировать не настолько сложно как об этом говорят. Ёлки — это не просто красивое дерево. Это прочная древесина.`,
    "createdAt": `2021-05-16 06:40:25`,
    "categories": [
      `Деревья`,
      `Разное`
    ],
    "comments": [
      {
        "user": `ivanov@example.com`,
        "text": `Мне кажется или я уже читал это где-то?`
      }
    ]
  }
];

const createAPI = async () => {
  const mockDB = new Sequelize(`sqlite::memory:`, {logging: false});

  await initDB(mockDB, {users: mockUsers, articles: mockArticles, categories: mockCategories});
  const app = express();
  app.use(express.json());
  user(app, new UserService(mockDB));

  return app;
};

describe(`API creates a user if form's data is valid. Email is original`, () => {
  const newUser = {
    name: `Alex`,
    surname: `Yufetsin`,
    avatar: ``,
    email: `sanek@mail.ru`,
    password: `mypassword`,
    passwordRepeat: `mypassword`
  };

  let response;
  let app;

  beforeAll(async () => {
    app = await createAPI();
    response = await request(app)
      .post(`/user`)
      .send(newUser);
  });

  test(`Status code 201`, () => expect(response.statusCode).toBe(HttpCode.CREATED));
});


describe(`API refuses to create a user if form's data is invalid`, () => {
  const newUser = {
    name: 123324,
    surname: 1233323,
    avatar: 22344354,
    email: `sanek@mail`,
    password: `f2sr`,
    passwordRepeat: `f2ewewf`
  };

  let app;
  let response;

  beforeAll(async () => {
    app = await createAPI();
    response = await request(app)
      .post(`/user`)
      .send(newUser);
  });

  test(`Status code 400`, () => expect(response.statusCode).toBe(HttpCode.BAD_REQUEST));
  test(`There are all filling mistakes from form's data`, () => {
    const allMistakes = [
      `"name" must be a string`,
      `"surname" must be a string`,
      `"avatar" must be a string`,
      `Некорректный формат почты`,
      `Пароль должен быть не меньше 6 символов`,
      `Пароли не совпадают`
    ];

    expect(response.body.errorMessages).toEqual(expect.arrayContaining(allMistakes));
  });
});

describe(`API refuses to create a user if form's data is valid, but email occupied`, () => {
  const newUser = {
    name: `Alex`,
    surname: `Yufetsin`,
    avatar: ``,
    email: `alex@gmail.com`,
    password: `mypassword`,
    passwordRepeat: `mypassword`
  };

  let app;
  let response;

  beforeAll(async () => {
    app = await createAPI();
    response = await request(app)
      .post(`/user`)
      .send(newUser);
  });

  test(`Status code 400`, () => expect(response.statusCode).toBe(HttpCode.BAD_REQUEST));
  test(`Error message should be 'Пользователь с такой почтой уже зарегистрирован'`,
      () => expect(response.body.errorMessages[0]).toBe(`Пользователь с такой почтой уже зарегистрирован`));
});

describe(`API authenticate user if data is valid`, () => {
  const validAuthData = {
    email: `ivanov@example.com`,
    password: `ivanov`
  };

  let response;

  beforeAll(async () => {
    const app = await createAPI();
    response = await request(app)
      .post(`/user/auth`)
      .send(validAuthData);
  });

  test(`Status code is 200`, () => expect(response.statusCode).toBe(HttpCode.OK));

  test(`User name is Иван Иванов`, () => expect(response.body.name).toBe(`Иван`));
});

describe(`API refuses to authenticate user if data is invalid`, () => {
  let app;

  beforeAll(async () => {
    app = await createAPI();
  });

  test(`If email is incorrect status is 401`, async () => {
    const badAuthData = {
      email: `not-exist@example.com`,
      password: `petrov`
    };
    await request(app)
      .post(`/user/auth`)
      .send(badAuthData)
      .expect(HttpCode.UNAUTHORIZED);
  });

  test(`If password doesn't match status is 401`, async () => {
    const badAuthData = {
      email: `petrov@example.com`,
      password: `ivanov`
    };
    await request(app)
      .post(`/user/auth`)
      .send(badAuthData)
      .expect(HttpCode.UNAUTHORIZED);
  });
});
